Autodesk.Revit.UI.PulldownButtonData.#ctor(System.String,System.String)
Constructs a new instance of PulldownButtonData.
name: The internal name of the new button.
The user visible text seen on the new button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when null is passed for one or more arguments.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when an empty string is passed for one or more arguments.

Autodesk.Revit.UI.PulldownButtonData
This class contains information necessary to construct a pulldown button in the Ribbon.